backup/Base/constant/polyMesh/boundary
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class polyBoundaryMesh;
 location "constant/polyMesh";
 object boundary;
}

(
  FrontAndBack

  {
    type empty;
    physicalType patch;
    nFaces 109618;
    startFace 97466;

  }
  patch1

  {
    type wall;
    physicalType patch;
    nFaces 98;
    startFace 207084;

  }
  patch2

  {
    type wall;
    physicalType patch;
    nFaces 98;
    startFace 207182;

  }
  patch3

  {
    type wall;
    physicalType patch;
    nFaces 98;
    startFace 207280;

  }
  Shaft

  {
    type wall;
    physicalType patch;
    nFaces 68;
    startFace 207378;

  }
  Inlet

  {
    type patch;
    physicalType patch;
    nFaces 79;
    startFace 207446;

  }
  Lat-Wall

  {
    type wall;
    physicalType patch;
    nFaces 98;
    startFace 207525;

  }
  Outlet

  {
    type patch;
    physicalType patch;
    nFaces 79;
    startFace 207623;

  }
  AMI-St

  {
	type cyclicAMI;
    neighbourPatch AMI-Rt;
    matchTolerance 1e-4;
    nFaces 249;
    startFace 207702;

  }
  AMI-Rt

  {
	type cyclicAMI;
    neighbourPatch AMI-St;
    matchTolerance 1e-4;
    nFaces 249;
    startFace 207951;

  }
)


// ************************************************************************* //
