backup/Base/0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    FrontAndBack
    {
        type            empty;
    }
    patch1
    {
        type            calculated;
        value           nonuniform List<scalar> 
98
(
11.5132
10.7694
9.97438
9.65003
9.60161
9.70547
9.89842
10.1395
...
)
;
    }
    patch2
    {
        type            calculated;
        value           nonuniform List<scalar> 
98
(
11.5055
10.7616
9.97314
9.64869
9.59934
9.70615
9.90077
10.1358
...
)
;
    }
    patch3
    {
        type            calculated;
        value           nonuniform List<scalar> 
98
(
11.5099
10.7637
9.96694
9.64608
9.60105
9.70088
9.8972
10.1358
...
)
;
    }
    Shaft
    {
        type            calculated;
        value           nonuniform List<scalar> 
68
(
0.682512
0.682291
0.68217
0.682343
0.682301
0.682218
0.68254
0.682627
...
)
;
    }
    Inlet
    {
        type            calculated;
        value           uniform 0;
    }
    Lat-Wall
    {
        type            calculated;
        value           nonuniform List<scalar> 
98
(
1273.75
294.535
309.651
277.004
237.157
597.433
593.139
908.157
...
)
;
    }
    Outlet
    {
        type            calculated;
        value           uniform 0;
    }
    AMI-St
    {
        type            cyclicAMI;
        value           uniform 0;
    }
    AMI-Rt
    {
        type            cyclicAMI;
        value           uniform 0;
    }
}


// ************************************************************************* //
